samples/business-process-samples/product/src/main/resources/bpel/2.0/ThrowCatchFaultHandling/test.properties

#
#    Licensed to the Apache Software Foundation (ASF) under one or more
#    contributor license agreements.  See the NOTICE file distributed with
#    this work for additional information regarding copyright ownership.
#    The ASF licenses this file to You under the Apache License, Version 2.0
#    (the "License"); you may not use this file except in compliance with
#    the License.  You may obtain a copy of the License at
#
#       http://www.apache.org/licenses/LICENSE-2.0
#
#    Unless required by applicable law or agreed to in writing, software
#    distributed under the License is distributed on an "AS IS" BASIS,
#    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
#    See the License for the specific language governing permissions and
#    limitations under the License.
#

namespace=workflowns
service=TestCase
operation=ExecuteWorkflow
request1=<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wor="workflowns">
   <soapenv:Header/>
   <soapenv:Body>
      <wor:ExecuteWorkflow>
         <wor:value>1</wor:value>
      </wor:ExecuteWorkflow>
   </soapenv:Body>
</soapenv:Envelope>

response1=<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Body>
      <soapenv:Fault>
         <faultcode>soapenv:Server</faultcode>
         <faultstring xmlns:axis2ns1="workflowns">axis2ns1:InputException2</faultstring>
         <detail/>
      </soapenv:Fault>
   </soapenv:Body>
</soapenv:Envelope>


request2=<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wor="workflowns">
   <soapenv:Header/>
   <soapenv:Body>
      <wor:ExecuteWorkflow>
         <wor:value>2</wor:value>
      </wor:ExecuteWorkflow>
   </soapenv:Body>
</soapenv:Envelope>

response2=<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Body>
      <soapenv:Fault>
         <faultcode>soapenv:Server</faultcode>
         <faultstring xmlns:axis2ns2="workflowns">axis2ns2:TransitionConditionOutOfRangeException1</faultstring>
         <detail/>
      </soapenv:Fault>
   </soapenv:Body>
</soapenv:Envelope>
